# Parte I - Limpieza y Creación de un base de datos

![ejercicios](img/ejercicios.png)

# 1 - Exploración y limpieza.

En la carpeta `data` de este ejercicio hay 8 archivos csv. Cada uno de ellos corresponde a una entidad de una base de datos que pertenece a una compañia de compra-venta de automóviles clásicos. Estas son: `customers`, `employees`, `offices`, `orderdetails`, `orders`, `payments`, `productlines` y `products`.

La primera tarea consiste en explorar los datos y realizar la limpieza si fuera necesario. ¿Existen nulos?.¿Cuales son las columnas?. ¿Existe relación entre las distintas tablas?

In [1]:
import pandas as pd

In [2]:
# todos los nombre de las tablas

tables=['customers',
        'employees',
        'offices',
        'orderdetails',
        'orders',
        'payments',
        'productlines',
        'products']

In [3]:
# todos las tablas como dataframe

dfs={}


for t in tables:
    dfs[t]=pd.read_csv(f'data/{t}.csv')

In [4]:
# limpieza customers 

dfs['customers']['salesRepEmployeeNumber']=dfs['customers']['salesRepEmployeeNumber'].fillna(.0)

dfs['customers']['postalCode']=dfs['customers']['postalCode'].fillna('unknown')

dfs['customers']['state']=dfs['customers']['state'].fillna('unknown')

dfs['customers']['addressLine2']=dfs['customers']['addressLine2'].fillna('unknown')

dfs['customers'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customerNumber          122 non-null    int64
 1   customerName            122 non-null    object
 2   contactLastName         122 non-null    object
 3   contactFirstName        122 non-null    object
 4   phone                   122 non-null    object
 5   addressLine1            122 non-null    object
 6   addressLine2            122 non-null    object
 7   city                    122 non-null    object
 8   state                   122 non-null    object
 9   postalCode              122 non-null    object
 10  country                 122 non-null    object
 11  salesRepEmployeeNumber  122 non-null    float64
 12  creditLimit             122 non-null    float64
dtypes: float64(2), int64(1), object(10)
memory usage: 12.5+ KB

In [5]:
# limpieza employees

dfs['employees']['reportsTo']=dfs['employees']['reportsTo'].fillna(.0)

dfs['employees'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   employeeNumber  23 non-null     int64
 1   lastName        23 non-null     object
 2   firstName       23 non-null     object
 3   extension       23 non-null     object
 4   email           23 non-null     object
 5   officeCode      23 non-null     int64
 6   reportsTo       23 non-null     float64
 7   jobTitle        23 non-null     object
dtypes: float64(1), int64(2), object(5)
memory usage: 1.6+ KB

In [6]:
# limpieza offices

dfs['offices']=dfs['offices'].fillna('unknown')

dfs['offices'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   officeCode    7 non-null      int64
 1   city          7 non-null      object
 2   phone         7 non-null      object
 3   addressLine1  7 non-null      object
 4   addressLine2  7 non-null      object
 5   state         7 non-null      object
 6   country       7 non-null      object
 7   postalCode    7 non-null      object
 8   territory     7 non-null      object
dtypes: int64(1), object(8)
memory usage: 632.0+ bytes

In [7]:
# limpieza orderdetails (esta limpio)

dfs['orderdetails'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2996 entries, 0 to 2995
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   orderNumber      2996 non-null   int64
 1   productCode      2996 non-null   object
 2   quantityOrdered  2996 non-null   int64
 3   priceEach        2996 non-null   float64
 4   orderLineNumber  2996 non-null   int64
dtypes: float64(1), int64(3), object(1)
memory usage: 117.2+ KB

In [8]:
# limpieza orders

dfs['orders']=dfs['orders'].fillna('unknown')

dfs['orders'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 326 entries, 0 to 325
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   orderNumber     326 non-null    int64
 1   orderDate       326 non-null    object
 2   requiredDate    326 non-null    object
 3   shippedDate     326 non-null    object
 4   status          326 non-null    object
 5   comments        326 non-null    object
 6   customerNumber  326 non-null    int64
dtypes: int64(2), object(5)
memory usage: 18.0+ KB

In [9]:
# limpieza payments (esta limpio)

dfs['payments'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 273 entries, 0 to 272
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customerNumber  273 non-null    int64
 1   checkNumber     273 non-null    object
 2   paymentDate     273 non-null    object
 3   amount          273 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 8.7+ KB

In [10]:
# limpieza productlines

dfs['productlines']=dfs['productlines'].fillna(.0)

dfs['productlines'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   productLine      7 non-null      object
 1   textDescription  7 non-null      object
 2   htmlDescription  7 non-null      float64
 3   image            7 non-null      float64
dtypes: float64(2), object(2)
memory usage: 352.0+ bytes

In [11]:
# limpieza products (esta limpio)

dfs['products'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   productCode         110 non-null    object
 1   productName         110 non-null    object
 2   productLine         110 non-null    object
 3   productScale        110 non-null    object
 4   productVendor       110 non-null    object
 5   productDescription  110 non-null    object
 6   quantityInStock     110 non-null    int64
 7   buyPrice            110 non-null    float64
 8   MSRP                110 non-null    float64
dtypes: float64(2), int64(1), object(6)
memory usage: 7.9+ KB

# 2 - Diagrama Entidades-Relaciones (ERD).

![erd](img/erd.png)


Una vez que se han explorado los datos y están limpios, procedemos a crear la estructura de la base de datos. Primero se crea una base de datos vacía y después se diseña la estructura de la base de datos con el diagrama de entidades-relaciones (ERD). 

Con el diseño del diagrama, podemos obtener una query que, cuando se ejecuta, genera la estructura de tablas y relaciones de la base de datos.

In [12]:
# Ejemplo de ERD

# 3 - Inserción de datos

Ahora que tenemos la base de datos creada y con su estructura diseñada, se procede a insertar los datos. Pasamos los datos de los archivos `.csv` a nuestra base de datos `SQL`.

In [13]:
from sqlalchemy import create_engine

In [14]:
# lenguaje+driver://usuario:password@servidor:puerto/database  # string de conexion

str_conn='mysql+pymysql://root:password@localhost:3306/vehicles'

motor=create_engine(str_conn)

In [15]:
# todas las tablas a sql

for t in tables:
    dfs[t].to_sql(name=t, con=motor, if_exists='append', index=False)

In [16]:
# check

pd.read_sql('select * from employees', motor).tail()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088.0,Sales Rep
19,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088.0,Sales Rep
20,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep
21,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621.0,Sales Rep
22,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep